================================================================================
SPACECRAFT COMMAND REFERENCE
6U CubeSat Ground Command Display System
================================================================================

This document describes all available commands for nominal operations and
anomaly response. Commands can be typed in the Control GUI command window
or executed via buttons in the EID GUI.

================================================================================
NOMINAL OPERATIONS COMMANDS
================================================================================

ATTITUDE CONTROL COMMANDS
-------------------------
ATT_NADIR
    Description: Point spacecraft nadir (Earth-facing)
    Parameters: None
    Example: ATT_NADIR
    Result: Attitude mode set to nadir pointing, targets 0° roll/pitch/yaw

ATT_SUN_POINT
    Description: Point spacecraft toward sun for maximum power generation
    Parameters: None
    Example: ATT_SUN_POINT
    Result: Attitude mode set to sun pointing, increases solar array current

ATT_INERTIAL
    Description: Hold current inertial attitude (no active pointing)
    Parameters: None
    Example: ATT_INERTIAL
    Result: Spacecraft maintains current attitude, minimal reaction wheel usage

ATT_SLEW <roll> <pitch> <yaw>
    Description: Slew spacecraft to specified attitude
    Parameters: 
        roll    - Roll angle in degrees (-180 to +180)
        pitch   - Pitch angle in degrees (-90 to +90)
        yaw     - Yaw angle in degrees (-180 to +180)
    Examples:
        ATT_SLEW 0 0 0          (point to default orientation)
        ATT_SLEW 45 0 0         (roll 45 degrees)
        ATT_SLEW 0 -15 90       (pitch down 15°, yaw 90°)
    Result: Spacecraft slews to target attitude at controlled rate


OPERATIONAL MODE COMMANDS
--------------------------
MODE_NOMINAL
    Description: Normal operations mode
    Parameters: None
    Example: MODE_NOMINAL
    Power: ~10W consumption, all systems active
    Result: Standard operations with full functionality

MODE_SCIENCE
    Description: Science/payload operations mode (high power)
    Parameters: None
    Example: MODE_SCIENCE
    Power: ~14W consumption, payload instruments active
    Result: Increased power consumption for science operations

MODE_LOW_POWER
    Description: Low power conservation mode
    Parameters: None
    Example: MODE_LOW_POWER
    Power: ~5W consumption, non-essential systems off
    Result: Reduced functionality to conserve battery power


THRESHOLD ADJUSTMENT COMMANDS
------------------------------
THR_BATT_MIN <voltage>
    Description: Set minimum battery voltage threshold (warning level)
    Parameters:
        voltage - Voltage in volts (V), typically 10.5-11.5V for 12V system
    Examples:
        THR_BATT_MIN 10.8       (set warning at 10.8V)
        THR_BATT_MIN 11.0       (more conservative threshold)
    Result: Warning triggers when battery drops below this value

THR_BATT_CAUT <voltage>
    Description: Set battery caution voltage threshold
    Parameters:
        voltage - Voltage in volts (V), typically 11.0-11.5V
    Examples:
        THR_BATT_CAUT 11.2      (caution at 11.2V)
        THR_BATT_CAUT 11.5      (earlier warning)
    Result: Caution triggers when battery drops below this value

THR_TEMP_MIN <temperature>
    Description: Set minimum internal temperature threshold (warning level)
    Parameters:
        temperature - Temperature in Celsius (°C)
    Examples:
        THR_TEMP_MIN 0          (warning below 0°C)
        THR_TEMP_MIN 5          (warning below 5°C)
    Result: Warning triggers when temp drops below this value

THR_TEMP_MAX <temperature>
    Description: Set maximum internal temperature threshold (warning level)
    Parameters:
        temperature - Temperature in Celsius (°C)
    Examples:
        THR_TEMP_MAX 40         (warning above 40°C)
        THR_TEMP_MAX 45         (higher tolerance)
    Result: Warning triggers when temp exceeds this value

THR_ATT_CAUT <degrees>
    Description: Set attitude deviation caution threshold
    Parameters:
        degrees - Angle in degrees from target attitude
    Examples:
        THR_ATT_CAUT 5          (caution at 5° deviation)
        THR_ATT_CAUT 10         (more tolerant)
    Result: Caution triggers when attitude deviates beyond this angle

THR_ATT_WARN <degrees>
    Description: Set attitude deviation warning threshold
    Parameters:
        degrees - Angle in degrees from target attitude
    Examples:
        THR_ATT_WARN 10         (warning at 10° deviation)
        THR_ATT_WARN 15         (more tolerant)
    Result: Warning triggers when attitude deviates beyond this angle


================================================================================
ANOMALY RESPONSE COMMANDS
================================================================================

SAFE_MODE
    Description: Enter safe mode - minimal power, sun pointing, all systems reset
    Parameters: None
    Example: SAFE_MODE
    Result: 
        - Operational mode set to SAFE
        - Attitude set to sun pointing
        - All attitudes reset to 0°
        - Battery protected (min consumption)
        - All anomaly flags cleared
    Use When: Multiple failures, critical battery, unknown anomaly

PWR_RESET
    Description: Reset power system to nominal state
    Parameters: None
    Example: PWR_RESET
    Result:
        - Battery A voltage restored to 11.8V (85% SOC)
        - Battery B voltage restored to 11.8V (85% SOC)
        - Power anomaly flag cleared
    Use When: Battery voltage anomaly, power system fault

EPS_DEPLOY_ARRAY_A
    Description: Deploy solar array A
    Parameters: None
    Example: EPS_DEPLOY_ARRAY_A
    Result:
        - Solar array A deployed
        - Array A begins generating power from sunlight (0-15W depending on sun angle)
        - EVR log entry created
    Use When: Initial deployment after launch, or after array stowage
    Note: Arrays must be deployed to generate power

EPS_DEPLOY_ARRAY_B
    Description: Deploy solar array B
    Parameters: None
    Example: EPS_DEPLOY_ARRAY_B
    Result:
        - Solar array B deployed
        - Array B begins generating power from sunlight (0-15W depending on sun angle)
        - EVR log entry created
    Use When: Initial deployment after launch, or after array stowage
    Note: Arrays must be deployed to generate power

EPS_CROSS_CHARGE_ENABLE
    Description: Enable cross-charging between Battery A and Battery B
    Parameters: None
    Example: EPS_CROSS_CHARGE_ENABLE
    Result:
        - Cross-charging enabled
        - Batteries will balance voltage/SOC automatically
        - Higher voltage battery transfers charge to lower voltage battery
        - EVR log entry created
    Use When: One battery significantly lower than other, need balanced system
    Note: Provides redundancy but reduces charging efficiency slightly

EPS_CROSS_CHARGE_DISABLE
    Description: Disable cross-charging between batteries
    Parameters: None
    Example: EPS_CROSS_CHARGE_DISABLE
    Result:
        - Cross-charging disabled
        - Battery A charges only from Array A
        - Battery B charges only from Array B
        - EVR log entry created
    Use When: One battery suspected faulty, want independent operation
    Note: Default state - batteries operate independently for maximum reliability


COMMUNICATIONS SYSTEM COMMANDS
-------------------------------
COMM_TX [timeout_seconds]
    Description: Set communications to transmit mode
    Parameters: 
        timeout_seconds - Optional timeout to auto-return to RX (0 = no timeout)
    Examples:
        COMM_TX           (transmit indefinitely)
        COMM_TX 300       (transmit for 5 minutes then return to RX)
    Result:
        - COMM mode set to TX
        - Transmit power active at current setting (20/27/30 dBm)
        - RX disabled (cannot receive during TX)
    Use When: Need to transmit telemetry or command acknowledgments
    Note: High power consumption - return to RX when not transmitting

COMM_RX
    Description: Set communications to receive mode
    Parameters: None
    Example: COMM_RX
    Result:
        - COMM mode set to RX
        - Ready to receive uplink commands
        - Lower power consumption than TX
    Use When: Normal operations, listening for ground commands
    Note: Default/nominal mode for COMM system

COMM_TX_RX
    Description: Set communications to full duplex mode (simultaneous TX/RX)
    Parameters: None
    Example: COMM_TX_RX
    Result:
        - COMM mode set to TX_RX (full duplex)
        - Can transmit and receive simultaneously
        - Highest power consumption mode
        - No timeout - remains in full duplex until commanded otherwise
    Use When: Critical operations requiring continuous uplink/downlink
    Note: Exits safe mode if active

COMM_STANDBY
    Description: Set communications to standby (low power, minimal activity)
    Parameters: None
    Example: COMM_STANDBY
    Result:
        - COMM mode set to STANDBY
        - Cannot TX or RX
        - Lowest power consumption
    Use When: Power conservation, thermal management
    Note: Must return to RX/TX to resume communications

COMM_POWER_30
    Description: Set transmit power to high (30 dBm / 1W)
    Parameters: None
    Example: COMM_POWER_30
    Result: TX power set to 30 dBm (maximum)
    Use When: Long distance, poor link margin

COMM_POWER_27
    Description: Set transmit power to medium (27 dBm / 500mW)
    Parameters: None
    Example: COMM_POWER_27
    Result: TX power set to 27 dBm (nominal)
    Use When: Normal operations, good link margin

COMM_POWER_20
    Description: Set transmit power to low (20 dBm / 100mW)
    Parameters: None
    Example: COMM_POWER_20
    Result: TX power set to 20 dBm (minimum)
    Use When: Close proximity ground station, power conservation


================================================================================
PROPULSION COMMANDS - Heated Catalyst Monopropellant System
================================================================================

The propulsion system uses a two-stage power architecture:
  1. STANDBY MODE (5V rail): Powers electronics only
  2. SYSTEM ON (VBat): Powers catalyst heater and valve actuators

The catalyst bed must be heated to 350°C for operation. Catalyst reaches ready
state at 300°C (typically 2-3 minutes warm-up time). Monopropellant (N2H4)
decomposes on contact with hot catalyst bed to produce thrust.

PROP_STANDBY
    Description: Enable propulsion standby mode (5V electronics power)
    Parameters: None
    Example: PROP_STANDBY
    Result:
        - 5V power enabled (~0.5W)
        - Electronics and sensors powered
        - Heater and valves remain unpowered
    Use When: Preparing for propulsion operations
    Note: Required before PROP_ON

PROP_ON
    Description: Enable full propulsion system (VBat power)
    Parameters: None
    Example: PROP_ON
    Prerequisites: PROP_STANDBY must be active
    Result:
        - VBat power enabled
        - Heater and valve actuators powered
        - System ready for catalyst heating
    Use When: Need thrust capability
    Note: Does not automatically enable heater - use PROP_HEATER_ON

PROP_OFF
    Description: Disable propulsion system completely
    Parameters: None
    Example: PROP_OFF
    Result:
        - Disables VBat and 5V power
        - Closes valve
        - Turns off catalyst heater
        - Catalyst begins cooling
    Use When: End of propulsion operations, power conservation

PROP_HEATER_ON
    Description: Turn on catalyst bed heater
    Parameters: None
    Example: PROP_HEATER_ON
    Prerequisites: PROP_ON (system enabled)
    Result:
        - Catalyst heater ON (25W draw)
        - Begins heating to 350°C target
        - Takes 2-3 minutes to reach ready state (300°C)
    Use When: Preparing for thrust operations
    Note: Monitor catalyst_temp and catalyst_ready telemetry

PROP_HEATER_OFF
    Description: Turn off catalyst bed heater
    Parameters: None
    Example: PROP_HEATER_OFF
    Result:
        - Catalyst heater OFF
        - Catalyst begins cooling
        - Catalyst goes NOT READY when temp < 300°C
    Use When: After maneuvers complete, power conservation

PROP_VALVE_OPEN
    Description: Open propellant valve to produce thrust
    Parameters: None
    Example: PROP_VALVE_OPEN
    Prerequisites:
        - PROP_ON (system enabled)
        - catalyst_ready = True (temp ≥ 300°C)
    Result:
        - Valve opens
        - Monopropellant flows to catalyst bed
        - Thrust produced (~1-5N typical)
        - Propellant consumed (~0.001 kg/sec)
    Use When: Performing maneuvers (desaturation, orbit adjust)
    Warning: Valve automatically closes if catalyst not ready

PROP_VALVE_CLOSE
    Description: Close propellant valve to stop thrust
    Parameters: None
    Example: PROP_VALVE_CLOSE
    Result:
        - Valve closes
        - Thrust stops
        - Propellant consumption stops
    Use When: End of maneuver

Typical Propulsion Operation Sequence:
    1. PROP_STANDBY           (Enable 5V electronics)
    2. PROP_ON                (Enable VBat power)
    3. PROP_HEATER_ON         (Start catalyst heating)
    4. [Wait 2-3 min]         (Monitor catalyst_temp, wait for catalyst_ready)
    5. PROP_VALVE_OPEN        (Produce thrust)
    6. [Perform maneuver]
    7. PROP_VALVE_CLOSE       (Stop thrust)
    8. PROP_HEATER_OFF        (Optional: save power)
    9. PROP_OFF               (Shutdown when done)


ATT_RESET
    Description: Reset attitude control system
    Parameters: None
    Example: ATT_RESET
    Result:
        - Roll, pitch, yaw all set to 0°
        - Target attitude reset
        - Attitude anomaly flag cleared
    Use When: Attitude deviation, control system fault

THERM_RESET
    Description: Reset thermal control system
    Parameters: None
    Example: THERM_RESET
    Result:
        - Internal temperature restored to 20°C nominal
        - Temperature anomaly flags cleared
    Use When: Over-temperature, under-temperature condition

COMM_RESET
    Description: Reset communication system
    Parameters: None
    Example: COMM_RESET
    Result:
        - Communication signal restored to 95%
        - Comm anomaly flag cleared
    Use When: Communication degradation, signal loss

CLEAR_CAUTIONS
    Description: Clear all caution flags (only if telemetry is nominal)
    Parameters: None
    Example: CLEAR_CAUTIONS
    Aliases: CLEAR_CAUT
    Result:
        - Clears caution flags if values are within nominal ranges
        - Does NOT clear if telemetry is still out of range
    Use When: After fixing issues, to acknowledge cautions

BATT_CHARGE
    Description: Boost battery charge by 1V
    Parameters: None
    Example: BATT_CHARGE
    Result:
        - Battery voltage increased by 1.0V (max 12.6V)
        - Battery anomaly cleared
    Use When: Battery low but not critical, need quick charge

EMERG_SHUTDOWN
    Description: Emergency shutdown of non-essential systems
    Parameters: None
    Example: EMERG_SHUTDOWN
    Result:
        - Mode changed to LOW_POWER
        - Battery current reduced to 0.4A (minimum)
    Use When: Critical battery situation, need to preserve power

DIAG_MODE
    Description: Enter diagnostic mode for system testing
    Parameters: None
    Example: DIAG_MODE
    Result: Log entry created, diagnostic tests initiated
    Use When: Investigating anomalies, routine maintenance


================================================================================
QUICK COMMAND SHORTCUTS (Button Commands)
================================================================================

CMD1 or CMD 1
    Quick Action: Set nadir pointing
    Equivalent: ATT_NADIR

CMD2 or CMD 2
    Quick Action: Set sun pointing
    Equivalent: ATT_SUN_POINT

CMD3 or CMD 3
    Quick Action: Enter science mode
    Equivalent: MODE_SCIENCE

CMD4 or CMD 4
    Quick Action: Enter low power mode
    Equivalent: MODE_LOW_POWER

CMD5 or CMD 5
    Quick Action: Clear all cautions
    Equivalent: CLEAR_CAUTIONS

CMD6 or CMD 6
    Quick Action: System health check
    Result: Reports all systems nominal

CMD7 or CMD 7
    Quick Action: Set communication rate to 9600 bps
    Result: Data rate set to maximum

CMD8 or CMD 8
    Quick Action: Reset watchdog timer
    Result: Watchdog timer reset logged


================================================================================
FAULT RECOVERY COMMANDS
================================================================================

When a subsystem fault is detected (faulted=True), that subsystem cannot be
enabled or commanded until it is power cycled. Power cycle commands clear the
fault flag and reset the subsystem to a safe default state.

ADCS_POWER_CYCLE
    Description: Power cycle ADCS subsystem to clear fault
    Parameters: None
    Example: ADCS_POWER_CYCLE
    Result:
        - Clears ADCS fault flag
        - Disables ADCS
        - Sets mode to DETUMBLE
        - Resets reaction wheel speeds to 0 RPM
    Use When: ADCS faulted, attitude control not responding

EPS_POWER_CYCLE
    Description: Power cycle EPS subsystem to clear fault
    Parameters: None
    Example: EPS_POWER_CYCLE
    Result:
        - Clears EPS fault flag
        - Sets mode to NOMINAL
    Use When: EPS faulted, power management not responding

COMM_POWER_CYCLE
    Description: Power cycle COMM subsystem to clear fault
    Parameters: None
    Example: COMM_POWER_CYCLE
    Result:
        - Clears COMM fault flag
        - Sets mode to RX (receive)
        - Resets temp to 25°C
        - Resets TX power to 27 dBm
    Use When: COMM faulted, communications not responding

PROP_POWER_CYCLE
    Description: Power cycle Propulsion subsystem to clear fault
    Parameters: None
    Example: PROP_POWER_CYCLE
    Result:
        - Clears PROP fault flag
        - Disables standby and system power (5V and VBat)
        - Closes propellant valve
        - Turns off catalyst heater
        - Resets all propulsion systems
    Use When: PROP faulted, propulsion not responding

TCS_POWER_CYCLE
    Description: Power cycle Thermal Control subsystem to clear fault
    Parameters: None
    Example: TCS_POWER_CYCLE
    Result:
        - Clears TCS fault flag
        - Turns off all heaters (AVI, EPS, PROP)
    Use When: TCS faulted, thermal control not responding

CDH_POWER_CYCLE
    Description: Power cycle Command & Data Handling subsystem to clear fault
    Parameters: None
    Example: CDH_POWER_CYCLE
    Result:
        - Clears CDH fault flag
        - Resets error count to 0
    Use When: CDH faulted, data handling not responding

TTC_POWER_CYCLE
    Description: Power cycle TT&C subsystem to clear fault
    Parameters: None
    Example: TTC_POWER_CYCLE
    Result:
        - Clears TTC fault flag
        - Resets link status to 'NO_LINK'
    Use When: TTC faulted, telemetry tracking not responding

STAR_TRACKER_POWER_CYCLE
    Description: Power cycle Star Tracker to clear fault
    Parameters: None
    Example: STAR_TRACKER_POWER_CYCLE
    Result:
        - Clears Star Tracker fault flag
        - Disables Star Tracker
        - Resets star count to 0
        - Clears attitude solution
    Use When: Star Tracker faulted, precision attitude unavailable

GPS_POWER_CYCLE
    Description: Power cycle GPS receiver to clear fault
    Parameters: None
    Example: GPS_POWER_CYCLE
    Result:
        - Clears GPS fault flag
        - Disables GPS
        - Resets satellite count to 0
        - Clears position/velocity solution
    Use When: GPS faulted, navigation solution unavailable


================================================================================
NAVIGATION SYSTEM COMMANDS
===============================================================================

STAR_TRACKER_ON
    Description: Enable Star Tracker for precision attitude determination
    Parameters: None
    Example: STAR_TRACKER_ON
    Power: +2.5W
    Result:
        - Star Tracker powered on
        - Begins tracking stars in field of view
        - Provides high-accuracy attitude (0.5-15 arcsec depending on stability)
        - Requires stable attitude for good solution
    Use When: Need precision attitude determination (better than ADCS sensors)
    Note: Works best when ADCS is enabled and spacecraft is stable

STAR_TRACKER_OFF
    Description: Disable Star Tracker
    Parameters: None
    Example: STAR_TRACKER_OFF
    Result:
        - Star Tracker powered off (-2.5W)
        - Star tracking halted
        - Attitude solution no longer updated
    Use When: Power conservation, not needed for current operations

GPS_ON
    Description: Enable GPS receiver for position/velocity determination
    Parameters: None
    Example: GPS_ON
    Power: +3.0W
    Result:
        - GPS receiver powered on
        - Begins satellite acquisition (180 sec typical)
        - Provides position accuracy 15-50m in LEO
        - Provides velocity accuracy 0.1-0.5 m/s
    Use When: Need precise orbit determination beyond TLE propagation
    Note: LEO GPS requires 3-5 minutes for first fix

GPS_OFF
    Description: Disable GPS receiver
    Parameters: None
    Example: GPS_OFF
    Result:
        - GPS receiver powered off (-3.0W)
        - Satellite tracking halted
        - Position/velocity solution no longer updated
    Use When: Power conservation, orbit determination not critical


================================================================================
FAULT INJECTION COMMANDS (TESTING ONLY)
================================================================================

These commands control the fault injection system for training purposes.
When enabled, a random subsystem fault will be injected between 2-5 minutes
after mission start. Only one fault per test run.

FAULT_INJECTION_ENABLE
    Description: Enable fault injection for fault response training
    Parameters: None
    Example: FAULT_INJECTION_ENABLE
    Result:
        - Fault injection system armed
        - Random fault scheduled between T+2min and T+5min
        - Random subsystem will be faulted
        - EVR log shows scheduled time
    Use When: Beginning fault response training scenario
    Warning: Do NOT use during nominal operations training

FAULT_INJECTION_DISABLE
    Description: Disable fault injection system
    Parameters: None
    Example: FAULT_INJECTION_DISABLE
    Result:
        - Fault injection system disarmed
        - No fault will be injected (if not already injected)
        - EVR log confirms disablement
    Use When: Switching from fault response to nominal training
    Note: Cannot prevent fault if already scheduled/injected


================================================================================
COMMAND SYNTAX RULES
================================================================================

1. Commands are case-insensitive (ATT_NADIR = att_nadir = Att_Nadir)

2. Parameters must be separated by spaces

3. Numeric parameters:
   - Voltages: 10.0 to 13.0 (V)
   - Temperatures: -20 to 50 (°C)
   - Angles: -180 to +180 (degrees)

4. Multiple word commands use underscores (ATT_SLEW, not ATT SLEW)

5. Parameters in <brackets> are required

6. Parameters in [brackets] are optional (not used in current version)


================================================================================
TYPICAL COMMAND SEQUENCES
================================================================================

SCENARIO: Battery Low During Eclipse
-------------------------------------
1. ATT_SUN_POINT          (maximize solar exposure)
2. MODE_LOW_POWER         (reduce consumption)
3. Wait for sun exposure
4. MODE_NOMINAL           (return to normal ops)

SCENARIO: Attitude Deviation Detected
--------------------------------------
1. ATT_RESET              (reset attitude to 0°)
2. ATT_NADIR              (resume nadir pointing)
3. CLEAR_CAUTIONS         (clear caution flags)

SCENARIO: Temperature Exceeds Limits
-------------------------------------
1. MODE_LOW_POWER         (reduce heat generation)
2. ATT_SLEW 0 0 90        (different thermal orientation)
3. Wait for cooling
4. THERM_RESET            (reset thermal system)
5. MODE_NOMINAL           (resume operations)

SCENARIO: Multiple System Failures
-----------------------------------
1. SAFE_MODE              (emergency recovery)
2. Wait for stabilization
3. Assess systems via EVR log
4. Gradually return to nominal:
   a. MODE_NOMINAL
   b. ATT_NADIR
   c. CLEAR_CAUTIONS

SCENARIO: Science Operation Pass
---------------------------------
1. ATT_SLEW 0 -15 0       (point at target)
2. MODE_SCIENCE           (activate payload)
3. Wait for data collection
4. MODE_NOMINAL           (return to standard)
5. ATT_NADIR              (return to Earth-facing)


================================================================================
TELEMETRY MONITORING THRESHOLDS
================================================================================

Battery Voltage (12V System):
    Nominal:  12.0 - 12.6 V
    Caution:  11.2 - 12.0 V (yellow)
    Warning:  < 10.8 V (red)
    Critical: < 10.5 V (emergency shutdown recommended)

Internal Temperature:
    Nominal:  5 - 35 °C
    Caution:  0 - 5 °C or 35 - 40 °C (yellow)
    Warning:  < 0 °C or > 40 °C (red)
    Critical: < -5 °C or > 45 °C

Attitude Deviation:
    Nominal:  < 5° from target
    Caution:  5 - 10° (yellow)
    Warning:  > 10° (red)
    Critical: > 15° (control authority lost)

Communication Signal:
    Nominal:  > 75%
    Caution:  60 - 75% (yellow)
    Warning:  < 60% (red)
    Critical: < 40% (potential loss of signal)


================================================================================
COMMAND LOGGING
================================================================================

All commands are logged in the EVR (Event Record) log with:
- Timestamp
- Command text
- Execution result
- System state changes

Example EVR entries:
    2025-10-20 14:23:15 - CMD: Attitude mode set to NADIR pointing
    2025-10-20 14:23:45 - CMD: Battery minimum threshold set to 10.8V
    2025-10-20 14:24:12 - RESPONSE: Power system reset - battery restored to nominal


================================================================================
ERROR MESSAGES
================================================================================

Invalid Syntax:
    "ERROR: Invalid <command> syntax. Use: <proper syntax>"

Out of Range:
    "ERROR: Parameter out of range. Valid range: <min> to <max>"

Command Not Recognized:
    "Command received: <text>" (acknowledged but no action taken)


================================================================================
NOTES
================================================================================

1. Commands execute immediately (no confirmation required for safety)
2. For real missions, critical commands would require confirmation
3. Threshold changes persist until reset or spacecraft reboot
4. Safe mode can be exited by sending MODE_NOMINAL
5. All angles use aerospace convention: 
   - Roll: rotation about X (forward) axis
   - Pitch: rotation about Y (starboard) axis  
   - Yaw: rotation about Z (nadir) axis
6. FAULTED SUBSYSTEMS: When a subsystem shows 'faulted: True', it cannot be
   enabled or commanded until you send the appropriate POWER_CYCLE command.
   Example: If ADCS is faulted, commands like ADCS_NADIR will be rejected
   with "ADCS mode rejected - ADCS faulted (power cycle required)"
7. SAFE MODE ADCS: When entering safe mode, ADCS will remain enabled in
   DETUMBLE mode for attitude stabilization, UNLESS the ADCS itself is
   faulted. This ensures the spacecraft maintains attitude control during
   emergencies whenever possible.

================================================================================
END OF COMMAND REFERENCE
================================================================================
